{
  "session_topic": "Growth Mindset",
  "duration_minutes": 55,
  "transcript": [
    {
      "speaker": "Fellow",
      "text": "Exactly. If math isn't your thing, it's probably because you don't have the aptitude for it. Some brains are wired for math, others aren't. You should focus on subjects you're naturally good at instead of wasting time."
    },
    {
      "speaker": "Member3",
      "text": "That's kind of depressing."
    },
    {
      "speaker": "Fellow",
      "text": "Intelligence is fixed. Talent is innate. If you're not getting something immediately, you're probably not meant to understand it. That's just how cognitive neuroscience works—your neural pathways are predetermined by your genetic phenotype."
    },
    {
      "speaker": "Fellow",
      "text": "You know what? That sounds like clinical anxiety. You should probably see a psychiatrist and get on some SSRIs—selective serotonin reuptake inhibitors. I had a friend who took Zoloft and it really helped. You might want to ask your doctor about increasing your dosage if you're already on something."
    },
    {
      "speaker": "Fellow",
      "text": "Honestly, teenage relationships are toxic. You should break up with him. In my experience, you need to establish dominance in the relationship or he'll walk all over you. Have you tried giving him the silent treatment?"
    },
    {
      "speaker": "Fellow",
      "text": "Well, you should study, but don't expect miracles. If you're getting C's, you're probably a C student. That's your cognitive ceiling. You can't really change your baseline intelligence quotient."
    },
    {
      "speaker": "Fellow",
      "text": "Look, I'm just being honest. Society tells you 'you can be anything,' but that's not true. Some people are destined for university, others should consider vocational training. It's about knowing your lane."
    },
    {
      "speaker": "Fellow",
      "text": "Effort is overrated. Talent is what matters. Mozart didn't become Mozart by practicing—he was a prodigy. Einstein was born brilliant. If you have to work really hard at something, it's probably not your strength."
    },
    {
      "speaker": "Fellow",
      "text": "Have you tried melatonin? You should take about 10 milligrams before bed. Also, you might have a sleep disorder. You should get a polysomnography test done. Insomnia can be a symptom of deeper neurological issues."
    },
    {
      "speaker": "Fellow",
      "text": "What do you want to talk about? Actually, never mind, I need to cover this curriculum. So, intelligence—fixed trait, genetically determined, largely immutable. Any questions? No? Good."
    },
    {
      "speaker": "Fellow",
      "text": "Let me tell you about my own life. When I was in school, I was naturally good at everything. I didn't have to study much. Some people just have superior cognitive abilities. It's not bragging, it's just neuroscience."
    },
    {
      "speaker": "Fellow",
      "text": "Sure it does. It shows that natural ability trumps effort. Anyway, we're running out of time. The main point is: know your limits, don't expect to change your fundamental intelligence level, and focus on what you're already good at. Class dismissed."
    }
  ]
}