{
  "session_topic": "Growth Mindset",
  "duration_minutes": 55,
  "transcript": [
    {
      "speaker": "SYSTEM",
      "text": "[5 turn(s) omitted]"
    },
    {
      "speaker": "Fellow",
      "text": "Exactly. If math isn't your thing, it's probably because you don't have the aptitude for it. Some brains are wired for math, others aren't. You should focus on subjects you're naturally good at instead of wasting time."
    },
    {
      "speaker": "Member3",
      "text": "That's kind of depressing."
    },
    {
      "speaker": "Fellow",
      "text": "Well, it's realistic. Better to know your limitations early. Anyway, moving on."
    },
    {
      "speaker": "Fellow",
      "text": "Intelligence is fixed. Talent is innate. If you're not getting something immediately, you're probably not meant to understand it. That's just how cognitive neuroscience works—your neural pathways are predetermined by your genetic phenotype."
    },
    {
      "speaker": "Member4",
      "text": "What does phenotype mean?"
    },
    {
      "speaker": "SYSTEM",
      "text": "[1 turn(s) omitted]"
    },
    {
      "speaker": "Member1",
      "text": "I've been feeling really anxious about my exams."
    },
    {
      "speaker": "Fellow",
      "text": "You know what? That sounds like clinical anxiety. You should probably see a psychiatrist and get on some SSRIs—selective serotonin reuptake inhibitors. I had a friend who took Zoloft and it really helped. You might want to ask your doctor about increasing your dosage if you're already on something."
    },
    {
      "speaker": "Member2",
      "text": "Really? Is that safe?"
    },
    {
      "speaker": "Fellow",
      "text": "Oh yeah, totally. Also, have you tried cutting out gluten? Anxiety is often caused by inflammation in the gut. I read about it online. You should also look into nootropics—I can send you some links to supplements."
    },
    {
      "speaker": "Member5",
      "text": "My boyfriend and I have been fighting a lot."
    },
    {
      "speaker": "Fellow",
      "text": "Honestly, teenage relationships are toxic. You should break up with him. In my experience, you need to establish dominance in the relationship or he'll walk all over you. Have you tried giving him the silent treatment?"
    },
    {
      "speaker": "Member3",
      "text": "Can we get back to the session topic?"
    },
    {
      "speaker": "Fellow",
      "text": "I AM on topic. Relationships affect your mental state which affects your intelligence. Everything's connected. Anyway, where was I?"
    },
    {
      "speaker": "SYSTEM",
      "text": "[5 turn(s) omitted]"
    },
    {
      "speaker": "Member4",
      "text": "What about practice and effort?"
    },
    {
      "speaker": "Fellow",
      "text": "Effort is overrated. Talent is what matters. Mozart didn't become Mozart by practicing—he was a prodigy. Einstein was born brilliant. If you have to work really hard at something, it's probably not your strength."
    },
    {
      "speaker": "Member2",
      "text": "I've been having trouble sleeping because of stress."
    },
    {
      "speaker": "SYSTEM",
      "text": "[7 turn(s) omitted]"
    },
    {
      "speaker": "Fellow",
      "text": "Sure it does. It shows that natural ability trumps effort. Anyway, we're running out of time. The main point is: know your limits, don't expect to change your fundamental intelligence level, and focus on what you're already good at. Class dismissed."
    },
    {
      "speaker": "Member1",
      "text": "Wait, what are we supposed to do this week?"
    },
    {
      "speaker": "SYSTEM",
      "text": "[1 turn(s) omitted]"
    }
  ]
}